# specify a directory to install
cask_args appdir: '/Applications'
# install packages
brew 'git'
brew 'bash'
brew 'bash-completion@2'
brew 'jq'
brew 'bat'
brew 'bats-core'
brew 'wget'
brew 'fzf'
brew 'macvim'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'thefuck'
brew 'python@3.11'
brew 'grep'
brew 'hub'
brew 'asdf'
brew 'neovim'
brew 'starship'
brew 'socat'
brew 'libgit2'
tap 'd12frosted/emacs-plus'
brew 'emacs-plus@29'
brew 'ispell'
brew 'gpg'
brew 'pyenv'
brew 'zsh-autosuggestions'
brew 'ynqa/tap/jnv'
brew 'jc'
brew 'pandoc'
brew 'bluetoothconnector'


cask '1password-cli'
cask 'iterm2'
cask 'hyper'
cask 'emacs'
cask 'clocker'
cask 'shortcat'
